export const ukr2latynka = (text, ver) => {
  var consolants = '([бвгґджзклмнпрстфхцчшщБВГҐДЖЗКЛМНПРСТФХЦЧШЩ])'
  var spec_cases = {
    'я':  'ia',
    'ю':  'iu',
    'є':  'ie',
  }

  for(let key in spec_cases) {
    text = text.replace(new RegExp(consolants + key, 'g'), '$1' + spec_cases[key])
  }

  var loz_version = {
    'ч':  'cz',
    'Ч':  'Cz',
    '(л)(ь|i|і)': 'l$2',
    '(Л)(ь|i|і)': 'L$2',
    'л':  'ł',
    'Л':  'Ł',
    'ш':  'sz',
    'Ш':  'Sz',
    'щ':  'szcz',
    'Щ':  'Szcz',
    'ж':  'ż',
    'Ж':  'Ż',
    'в':  'w',
    'В':  'W',
  }

  var irech_version = {
    'ч':  'č',
    'Ч':  'Č',
    'ль': 'ľ',
    'Ль': 'Ľ',
    'л':  'l',
    'Л':  'L',
    'ш':  'š',
    'Ш':  'Š',
    'щ':  'šč',
    'Щ':  'Šč',
    'ж':  'ž',
    'Ж':  'Ž',
    'в':  'v',
    'В':  'V',
  }

  var common_chars = {
    'а':  'a',
    'А':  'A',
    'б':  'b',
    'Б':  'B',
    'ць': 'ć',
    'Ць': 'Ć',
    'ц':  'c',
    'Ц':  'C',
    'х':  'ch',
    'Х':  'Ch',
    
    'дь': 'ď',
    'Дь': 'Ď',
    'д':  'd',
    'Д':  'D',
    'е':  'e',
    'Е':  'E',
    'ф':  'f',
    'Ф':  'F',
    'ґ':  'g',
    'Ґ':  'G',
    'г':  'h',
    'Г':  'H',
    'і':  'i',
    'І':  'I',
    'й':  'j',
    'Й':  'J',
    'к':  'k',
    'К':  'K',
    
    'м':  'm',
    'М':  'M',
    'нь': 'ń',
    'Нь': 'Ń',
    'н':  'n',
    'Н':  'N',
    'о':  'o',
    'О':  'O',
    'п':  'p',
    'П':  'P',
    'рь': 'ŕ',
    'Рь': 'Ŕ',
    'р':  'r',
    'Р':  'R',
    'сь': 'ś',
    'Сь': 'Ś',
    'с':  's',
    'С':  'S',
    
    'ть': 'ť',
    'Ть': 'Ť',
    'т':  't',
    'Т':  'T',
    'у':  'u',
    'У':  'U',

    'и':  'y',
    'И':  'Y',
    'зь': 'ź',
    'Зь': 'Ź',
    'з':  'z',
    'З':  'Z',
    
    'я':  'ja',
    'Я':  'Ja',
    'ї':  'ji',
    'Ї':  'Ji',
    'ю':  'ju',
    'Ю':  'Ju',
    'є':  'je',
    'Є':  'Je',
    'ь':  '',
    'Ь':  '',
  }

  var chars = null
  if(ver == 'loz')
    chars = Object.assign(loz_version, common_chars)
  else
    chars = Object.assign(irech_version, common_chars)

  for(let key in chars) {
    text = text.replace(new RegExp(key, 'g'), chars[key])
  }

  return text
}

export const pol2cyr = (text) => {
  var chars = {
    '(ia)|(ja)': 'я',
    'a': 'а',
    '(ie)|(je)': 'е',
    'y': 'ы',
    '(io)|(jo)': 'ë',
    '(ió)|(jó)|(iu)|(ju)': 'ю',
    '(ią)|(ją)': 'ѭ',
    '(ię)|(ję)': 'ѩ',
    'i': 'и',
    'e': 'э',
    'o': 'о',
    'ó|u': 'у',
    'ą': 'ѫ',
    'ę': 'ѧ',

    'szcz': 'щ',
    'sz': 'ш',
    '(ch)|(h)': 'х',
    'dź': 'дь',
    'd': 'д',
    'cz': 'ч',
    'rz': 'рь',
    'r': 'р',
    'p': 'п',
    'b': 'б',
    'f': 'ф',
    'w': 'в',
    't': 'т',
    'ć': 'ть',
    's|ś': 'с',
    'z|ź': 'з',
    'k': 'к',
    'g': 'г',
    'ż': 'ж',
    'c': 'ц',
    'm': 'м',
    'n': 'н',
    'ł': 'л',
    'l': 'ль',
    'j': 'й',

    '(Ia)|(Ja)': 'Я',
    'A': 'А',
    '(Ie)|(Je)': 'Е',
    'Y': 'Ы',
    '(Io)|(Jo)': 'Ë',
    '(Ió)|(Jó)|(Iu)|(Ju)': 'Ю',
    '(Ią)|(Ją)': 'Ѭ',
    '(Ię)|(Ję)': 'Ѩ',
    'I': 'И',
    'E': 'Э',
    'O': 'О',
    'Ó|U': 'У',
    'Ą': 'Ѫ',
    'Ę': 'Ѧ',

    'Szcz': 'Щ',
    'Sz': 'Ш',
    '(Ch)|(H)': 'Х',
    'Dź': 'Дь',
    'D': 'Д',
    'Cz': 'Ч',
    'Rz': 'Рь',
    'R': 'Р',
    'P': 'П',
    'B': 'Б',
    'F': 'Ф',
    'W': 'В',
    'T': 'Т',
    'Ć': 'Ть',
    'S|Ś': 'С',
    'Z|Ź': 'З',
    'K': 'К',
    'G': 'Г',
    'Ż': 'Ж',
    'C': 'Ц',
    'M': 'М',
    'N': 'Н',
    'Ł': 'Л',
    'L': 'Ль',
    'J': 'Й',

  }

  for(let key in chars) {
    text = text.replace(new RegExp(key, 'g'), chars[key])
  }

  return text
}